Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: This has been added to the core (version 1.39).
es_es: Fue añadido al núcleo principal (versión 1.39).

source: To get the actual exit value, shift right by eight (see below).
es_es: Para obtener el valor real de la salida, se debe desplazar ocho a la derecha (ver más abajo).

source: @contact = sort { find_records() } @key;
es_es: @contacto = sort { busca_registros() } @claves;

source: But the strict refs, vars, and subs are B<not> enforced when using this false idiom.
es_es: Sin embargo, los strict refs, vars y subs B<no> estaban forzados cuando se utilizaba ese falso modismo.

source: There are actually two varieties of null strings (sometimes referred to as "empty" strings), a defined one and an undefined one.
es_es: Hay en realidad dos tipos de cadenas nulas (a las que algunas veces nos referimos como cadenas "vacías"); una definida, y otra, indefinida.

source: In Perl 5.8.0 there were about 69000 separate tests in about 700 test files, in Perl 5.8.1 there are about 77000 separate tests in about 780 test files.
es_es: En Perl 5.8.0 había alrededor de 69.000 pruebas distintas en alrededor de 700 archivos de prueba, en Perl 5.8.1 hay cerca de 77.000 pruebas distintas en alrededor de 780 archivos de prueba.

source: Perl can now be built to detect attempts to assign pathologically large chunks of memory.
es_es: Perl ahora pueden ser compilado para que detecte los intentos de reservar bloques patológicamente grandes de memoria.

source: Finally, test using
es_es: Por último, pruebe con

source: Setting $0 works again (with certain limitations that Perl cannot do much about: see L<perlvar/$0>)
es_es: Estableciendo $0 funciona de nuevo (con ciertas limitaciones en las que Perl no ha podido hacer mucho al respecto: vea L<perlvar/$0>)

source: C<CGI> upgraded to version 3.15
es_es: C<CGI> actualizado a la versión 3.15

source: Many of Perl's syntactic elements are B<optional>.
es_es: Muchos de los elementos sintácticos de Perl son B<opcionales>.

source: L<perlfaq> contains questions and answers related to many common tasks, and often provides suggestions for good CPAN modules to use.
es_es: L<perlfaq> contiene preguntas y respuestas relacionadas con muchas tareas comunes, y en muchos casos sugiere los módulos de CPAN adecuados para cada tarea.

source: Encode upgraded to version 2.08
es_es: Encode actualizado a la versión 2.08

source: =head2 New Modules and Pragmata
es_es: =head2 Nuevos módulos y pragmas

source: perldebug Perl debugging
es_es: perldebug Depuración

source: Otherwise use a C<foreach()> loop or the C<system()> function instead.
es_es: De otra forma, use un bucle C<foreach()> o la función C<system()>.

source: Otherwise you create non-Y2K-compliant programs--and you wouldn't want to do that, would you?
es_es: De lo contrario está creando programas Y2K no compatibles -y usted no querría hacer eso, ¿verdad?-

source: You should also have received a copy of the GNU General Public License along with this program in the file named "Copying".
es_es: También debería haber recibido una copia de la Licencia Pública General GNU junto con este programa en el archivo llamado "Copying".

source: A C<pop> of an item from a shared array reference no longer causes a leak.
es_es: A C<pop> de un elemento de una referencia compartida a un array ya no provoca fugas de memoria.

source: It would be much better if you could ignore the NULL terminations issue in the main application code and have a mechanism that automatically added the terminating NULL to all keys and values whenever you write to the database and have them removed when you read from the database.
es_es: Sería mucho mejor poder ignorar el problema de los caracteres NULL de terminación de cadena en el código principal de la aplicación y disponer de un mecanismo que agregue automáticamente un carácter NULL de terminación a todas las claves y todos los valores que se escriban en la base de datos, y lo elimine al leer de la base de datos.

source: if ( condition ) {
es_es: if ( condición ) {

source: mung($first) or die "mung failed"; # Or here.
es_es: mung($first) or die "mung falló"; # O aquí.

source: C<CPAN> upgraded to version 1.76_02
es_es: C<CPAN> actualizado a la versión 1.76_02

source: FreeBSD has a bug where reading this symlink sometimes returns an incorrect value (see http://www.freebsd.org/cgi/query-pr.cgi?pr=35703 ).
es_es: FreeBSD tiene un error en la lectura de estos enlaces simbólicos: a veces devuelve un valor incorrecto (vea http://www.freebsd.org/cgi/query-pr.cgi?pr=35703 ).

source: Finally, F<find2perl> translates C<find> commands to Perl equivalents which use the L<File::Find|File::Find> module.
es_es: Por último, F<find2perl> traduce comandos C<find> en sus equivalentes Perl, que usan el módulo L<File::Find|File::Find>.

source: Because backticks do not affect standard error, use shell file descriptor syntax (assuming the shell supports this) if you care to address this.
es_es: Como las comillas invertidas no afectan a la salida de error estándar, use la sintaxis del shell del descriptor de archivos (asumiendo que el shell soporte esto) si es que quiere tenerlo en cuenta.

source: See below for more details and see C<sprintf(3)> or C<printf(3)> on your system for an explanation of the general principles.
es_es: Ver abajo para más detalles y ver C<sprintf(3)> o C<printf(3)> en su sistema para obtener una explicación de los principios generales.

source: Backreference to a named capture group.
es_es: Contrareferencia a un grupo de captura con nombre.

source: my $var = "value";
es_es: my $var = "valor";

source: The last example should print:
es_es: El último ejemplo debería imprimir:

source: Chops off the last character of a string and returns the character chopped.
es_es: Recorta el último carácter de un string y devuelve el carácter recortado.

source: This feature introduces three new keywords, C<given>, C<when>, and C<default>:
es_es: Esta característica introduce tres nuevas palabras clave, C<given>, C<when>, y C<default>:

source: C<seekdir> also has the same caveats about possible directory compaction as the corresponding system library routine.
es_es: C<seekdir> también tiene las mismas advertencias sobre la posible compactación del directorio como la correspondiente rutina del sistema.

source: Note the I<characters>: depending on the status of the socket, either (8-bit) bytes or characters are received.
es_es: Note los I<caracteres>: dependiendo del estado del socket, son leídos bytes (8-bit) o caracteres.

source: If the tied array class contains a package variable named C<$NEGATIVE_INDICES> which is set to a true value, negative values will be passed to C<FETCH>, C<STORE>, C<EXISTS>, and C<DELETE> unchanged.
es_es: Si la clase de array enlazado contiene una variable de paquete denominada C<$NEGATIVE_INDICES> que se establece a un valor real, los valores negativos serán pasados directamente a C<FETCH>, C<STORE>, C<EXISTS>, y C<DELETE>.

source: %d a signed integer, in decimal
es_es: %d un entero con signo, en decimal

source: Text from a C<"#"> character until the end of the line is a comment, and is ignored.
es_es: El texto desde un carácter C<"#"> hasta el fin de la línea es un comentario y es ignorado.

source: Checks if the expression has been evaluated while executing directly inside of the n-th capture group.
es_es: Comprueba si la expresión se ha evaluado mientras se ejecuta directamente en el interior del n-ésimo grupo de captura.

source: Because the transliteration table is built at compile time, neither the SEARCHLIST nor the REPLACEMENTLIST are subjected to double quote interpolation.
es_es: Debido a que la tabla de transliteración se construye en tiempo de compilación, ni la LISTA_BÚSQUEDA ni la LISTA_REEMPLAZO están sujetas a la interpolación del doble entrecomillado.

source: This aspect of C<shift> is considered highly experimental.
es_es: Este aspecto de C<shift> es considerado altamente experimental.

source: The optimisation has been re-instated, and the performance regression fixed.
es_es: La optimización ha sido reinstalado, y arreglada la regresión de rendimiento.

source: is a syntax error.
es_es: es un error de sintaxis.

source: $nothing = 1;
es_es: $nada = 1;

source: That's all!
es_es: ¡Eso es todo!

source: # if you run this in a job, do "make test_notty"
es_es: # si ejecuta esto en un trabajo, haga "make test_notty"

source: There, you use C<srand($seed)>, with the same C<$seed> each time.
es_es: Allí, puede utilizar C<srand($semilla)>, con la misma C<$semilla> cada vez.

source: =secret stuff
es_es: =material secreto

source: Binary "&&" performs a short-circuit logical AND operation.
es_es: Binario "&&" realiza una operación lógica AND abreviada.

source: That number gives the character's position in the character set encoding (indexed from 0).
es_es: Este número da la posición del carácter dentro de la codificación del conjunto de caracteres (comenzando en 0).

source: Because once upon a time, the argument to push() had to be be a real array, not just a reference to one.
es_es: Porque hubo un tiempo, en que el argumento de push() tenía que ser un array real, no sólo una referencia a un array.

source: use v5.6.1; # compile time version check
es_es: use v5.6.1; # comprobación en tiempo de compilación

source: \N{name} [3] named Unicode character or character sequence
es_es: \N{nombre} [3] nombre car. o secuencia car. Unicode

source: sets mode to # --w----r-T
es_es: pone el modo a # --w----r-T

source: Also, any file containing a zero byte in the first block is considered a binary file.
es_es: También, cualquier archivo conteniendo bytes cero en el primer bloque es considerado como un archivo binario.

source: Originally, a script was a canned sequence of normally interactive commands--that is, a chat script.
es_es: Originalmente, un script era una secuencia cerrada de comandos normalmente interactivos (es decir, un script de chat).

source: use Fcntl qw(:flock SEEK_END); # import LOCK_* and SEEK_END constants
es_es: use Fcntl qw(:flock SEEK_END); # importa constantes LOCK_* y SEEK_END

source: If the last element of LIST does not end in a newline, the current script line number and input line number (if any) are also printed, and a newline is supplied.
es_es: Si el último elemento de LISTA no acaba en el carácter de nueva línea, se imprimen también el valor actual del número de línea y el actual número de línea de entrada (si existe), junto con un carácter de nueva línea.

source: # this would print with a linebreak in the middle
es_es: # esto imprimirá un salto de línea en la mitad de la frase

source: If there is no current package (due to an empty C<package;> directive), __PACKAGE__ is the undefined value.
es_es: Si no hay paquete actual (debido a una directiva C<package;> vacía), __PACKAGE__ tiene el valor indefinido.

source: vec($foo, 21, 4) = 7; # 'PerlPerlPer' # 'r' is "\x72"
es_es: vec($foo, 21, 4) = 7; # 'PerlPerlPer' # 'r' es "\x72"

source: All operations above are performed simultaneously, left to right.
es_es: Todas las operaciones anteriores se realizan simultáneamente, de izquierda a derecha.

source: Win32.pm/Win32.xs has moved from the libwin32 module to core Perl
es_es: Win32.pm/Win32.xs se han trasladado desde el módulo libwin32 al núcleo de Perl

source: Accepts an incoming socket connect, just as accept(2) does.
es_es: Acepta una conexión socket entrante, como lo hace la llamada del sistema accept(2).

source: print(" alphanumeric"), redo LOOP if /\G[\p{Alpha}\pN]+\b[,.;]?\s*/gc;
es_es: print(" alfanumérico"), redo LOOP if /\G[\p{Alpha}\pN]+\b[,.;]?\s*/gc;

source: =item Other mathematical operators
es_es: =item Otros operadores matemáticos

source: In order to make it more robust it is recommended to start every program with the following lines:
es_es: Sin embargo, para trabajar de manera más segura se recomienda iniciar cada programa con las líneas siguientes:

source: After reading this document, you ought to read L<perlunifaq> too.
es_es: Después de leer este documento, debe leer L<perlunifaq>.

source: {3} matches exactly 3 of the previous thing
es_es: {3} detecta exactamente 3 coincidencias de lo anterior

source: See L<perlopentut> for a kinder, gentler explanation of opening files.
es_es: Ver L<perlopentut> para una más amable, más suave explicación de apertura de los archivos.

source: Okay, that's I<definitely> enough hype.
es_es: Entre otras...

source: perllol - Manipulating Arrays of Arrays in Perl
es_es: perllol - Manipulación de array de array en Perl

source: You can read more about pod in pod/perlpod.pod or the short summary in the INSTALL file.
es_es: Puede leer más acerca pod/perlpod.pod o el resumen en el fichero INSTALL.

source: The C<delete local EXPR> construct localizes the deletion to the current block at run time.
es_es: La construcción C<delete local EXPR> localiza la eliminación al actual bloque en tiempo de ejecución.

source: $symlink_exists = eval { symlink("",""); 1 };
es_es: $symlink_existe = eval { symlink("",""); 1 };

source: No variable interpolation occurs.
es_es: No se produce interpolación de variables.

source: # a real struct tm (on my system anyway)
es_es: # una auténtica struct tm (en mi sistema)

source: In the two-argument (and one-argument) form, opening C<< <- >> or C<-> opens STDIN and opening C<< >- >> opens STDOUT.
es_es: En la forma de dos argumentos (y de un argumento), abriendo C<< <- >> o C<-> abre STDIN, y abriendo C<< >- >> abre STDOUT.

source: Setting C<pos> also resets the I<matched with zero-length> flag, described under L<perlre/"Repeated Patterns Matching a Zero-length Substring">.
es_es: Actualizando C<pos> también reinicializa la bandera I<coincide con longitud cero>, descrita en L<perlre/"Coincidiendo con patrones repetidos en una cadena de longitud cero">.

source: The C<resolve> function is called to generate a linearised ISA for the given stash, using this MRO.
es_es: La función C<resolve> es llamada para generar un ISA en línea para el esquema indicado, utilizando este MRO.

source: So when you use this:
es_es: Así, cuando se ejecuta la siguiente instrucción:

source: In list context, returns a list value consisting of the elements of LIST in the opposite order.
es_es: En contexto de lista, devuelve una lista de valores consistente en los elementos de LISTA en el orden opuesto.

source: down from the door where it began.
es_es: detrás de la puerta que lo comenzó.

source: If I<sequence-item> refers to a string type (C<"A">, C<"a">, or C<"Z">), the I<length-item> is the string length, not the number of strings.
es_es: Si I<secuencia-item> se refiere a un tipo de cadena de caracteres (C<"A">, C<"a">, o C<"Z">), la I<longitud-item> es la longitud de la cadena, no el número de cadenas.

source: There are more Unicode encodings, but much of the world has standardized on UTF-8.
es_es: Hay otras codificaciones de Unicode, pero UTF-8 se está convirtiendo en la codificación estándar.

source: Here are commonly expected conventions:
es_es: Están son las convenciones más usadas:

source: Perl comes with a wide selection of builtin functions.
es_es: Perl incluye una amplia selección de funciones y operadores integrados.

source: For example, 0.9 cannot be represented by a native float, since the binary fraction for 0.9 is infinite:
es_es: Por ejemplo, 0.9 no se puede representar como un número de punto flotante nativo porque la fracción binaria correspondiente a 0.9 es infinita:

source: To exchange a command's STDOUT and STDERR in order to capture the STDERR but leave its STDOUT to come out the old STDERR:
es_es: Intercambiar el STDOUT y STDERR de un comando para capturar el STDERR pero dejando que su STDOUT salga por el anterior STDERR:

source: $is_setuid = $mode & S_ISUID;
es_es: $es_setuid = $modo & S_ISUID;

source: eval $search; # this screams
es_es: eval $buscar; # esto aúlla

source: Matches the best match for C<S> and only that.
es_es: Coincide con la mejor coincidencia de C<S> y sólo esa.

source: When the new binary is executed it will begin by executing a C<goto LABEL> (with all the restrictions that C<goto> suffers).
es_es: Cuando el nuevo binario es ejecutado, comenzará ejecutando un C<goto ETIQUETA> (con todas las restricciones que C<goto> padece).

# and [] character class . == [^ ]
source: and [] character class . == [^\n]
es_es: and [] clase caracteres . == [^\n]

source: See:
es_es: Vea:

source: If NUMBER is omitted, uses C<$_>.
es_es: Si se omite NÚMERO, se usa C<$_>.

source: =head2 Licensing
es_es: =head2 Licencias

source: You can open a file for input or output using the C<open()> function.
es_es: La función C<open()> abre un archivo para entrada o salida.

source: C<DB_File> upgraded to version 1.814
es_es: C<DB_File> actualizado a la versión 1.814

source: \Z Match only at end of string, or before newline at the end
es_es: \Z Coincide solo con el final de la cadena, o antes de un nueva línea al final

source: or, more directly,
es_es: o, más directamente,

source: Most systems do not bother to return anything useful in $timeleft, so calling select() in scalar context just returns $nfound.
es_es: La mayoría de los sistemas no se molestan en devolver nada útil en $tiempo_restante, así que llamando select() en contexto escalar sólo devuelve $n_encontrados.

source: New encoding C<MIME-Header-ISO_2022_JP> added
es_es: Añadida nueva codificación C<MIME-Header-ISO_2022_JP>

source: All of the core documentation intended for end users lives in F<pod/>.
es_es: Toda la documentación principal para usuarios finales se encuentra en F<pod/>.

source: The interpreter internals now support a far more memory efficient form of inlineable constants.
es_es: Las funciones incorporadas del intérprete ahora soportan un formato de memoria mucho más eficiente de las constantes que se pueden insertar en la traza del código (I<inline>).

source: use C<BE<lt>E<gt>> for commands names like B<cat> or B<grep>.
es_es: use C<BE<lt>E<gt>> para nombres de comandos como B<cat> o B<grep>.

# printf "Permissions are %04o ", $mode & 07777;
source: printf "Permissions are %04o\n", $mode & 07777;
es_es: printf "Permisos son %04o\n", $modo & 07777;

source: This is a useful optimization when you want to see only the first occurrence of something in each file of a set of files, for instance.
es_es: Esta es una optimización útil cuando se desea ver sólo la primera aparición de algo en cada archivo de un conjunto de archivos, por ejemplo.

source: They include variables, quote and quote-like operators, any expression in parentheses, and any function whose arguments are parenthesized.
es_es: Esto incluye a las variables, comillas y operadores de comillas, cualquier expresión entre paréntesis, y cualquier función cuyos argumentos estén entre paréntesis.

source: If C<do> cannot read the file, it returns undef and sets C<$!> to the error.
es_es: Si C<do> no puede leer el archivo, devuelve undef y pone C<$!> al valor del error.

source: Instead of using the current Perl internals, Ponie aimed to create a new one that would provide a translation path from Perl 5 to Perl 6 (or anything else that targets Parrot, actually).
es_es: La idea de Ponie era renovar los componentes internos de Perl para traducir código Perl 5 a Perl 6 (o a cualquier otro lenguaje compatible con Parrot).

source: The final sequence number in a range has the string "E0" appended to it, which doesn't affect its numeric value, but gives you something to search for if you want to exclude the endpoint.
es_es: El número de secuencia final en un rango tiene la cadena "E0" añadida, que no afecta a su valor numérico, pero le da algo para poder buscar si desea excluir el punto final.

source: default { $nothing = 1; }
es_es: default { $nada = 1; }

source: These files contain information on who maintains which modules.
es_es: En estos archivos se indica quién mantiene cada módulo.

source: This is useful for propagating exceptions:
es_es: Esto es útil para propagar excepciones:

source: Interpolated scalars and arrays are converted internally to the C<join> and C<.> catenation operations.
es_es: Escalares interpolados y arrays son convertidos internamente a las operaciones de concatenación C<join> y C<.>.

source: If the number is 256 (0x100, 0400) or above, Perl interprets it as a Unicode code point and the result is the corresponding Unicode character.
es_es: Si el número es 256 (0x100, 0400) o superior, Perl lo interpreta como un punto de código Unicode y el resultado es el correspondiente carácter Unicode.

source: SCALAR will be grown or shrunk to the length actually read.
es_es: ESCALAR crecerá o se reducirá a la longitud de la lectura actual.

source: Although strings and numbers are considered pretty much the same thing for nearly all purposes, references are strongly-typed, uncastable pointers with builtin reference-counting and destructor invocation.
es_es: Aunque las cadenas y los números son consideradas prácticamente la misma cosa para la mayoría de los propósitos, las referencias son punteros no convertibles y fuertemente tipificados, que llevan un contador de referencias incorporado y una invocación al destructor.

source: If the input string is longer than one described by the TEMPLATE, the remainder of that input string is ignored.
es_es: Si la cadena de entrada es superior a lo descrito por la PLANTILLA, el resto de la cadena de entrada se ignora.

source: C<open> upgraded to version 1.05
es_es: C<open> actualizado a la versión 1.05

source: You are responsible to make sure a string is pre-extended long enough to receive any result that might be written into a string.
es_es: Es responsable de asegurarse de que una cadena sea pre-extendida el largo suficiente como para recibir cualquier resultado que pueda ser escrito en una cadena.

source: ($who, $home) = @ENV{"USER", "HOME"}; # hash slice
es_es: ($quien, $home) = @ENV{"USER", "HOME"}; # porción hash

source: See the Camel Book for why.
es_es: Consulte el "Libro del Camello" (en concreto, camello arábigo, o dromedario) para averiguar por qué.

source: X<identifier, case sensitivity> X<case>
es_es: X<identifier, case sensitivity> X<case> X<identificador, sensible al tamaño de caja> X<tamaño de caja> X<mayúsculas y minúsculas>

source: Now works better with directories where access rights are more restrictive than usual.
es_es: Ahora funciona mejor con los directorios donde los derechos de acceso sean más restrictivos de lo habitual.

source: If you have a really hairy regular expression, use the C</x> modifier and put in some whitespace to make it look a little less like line noise.
es_es: Si tiene una expresión regular especialmente complicada, use el modificador C</x> y ponga algunos espacios en blanco para que no parezca una línea telefónica con ruido de fondo.

# print $file, " ";
source: print $file, "\n";
es_es: print $archivo, "\n";

source: If you want to position the file for C<sysread> or C<syswrite>, don't use C<seek>, because buffering makes its effect on the file's read-write position unpredictable and non-portable.
es_es: Si desea posicionar el archivo para las funciones C<sysread> o C<syswrite>, no utilice C<seek>, porque hace impredecible y no portátil la posición de lectura/escritura del archivo a causa del efecto del búfer del archivo.
